# Color Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
MaterialNode..::..Color Property
MaterialNode Class See Also
---
The color the material is being rendered at
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public Color Color { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Color As Color
	Get
```

Visual C++
---
```text
public:
property Color^ Color {
	Color^ get ();
}
```

# Remarks
The value may differ from the default color property of the material, because it might have been overridden by rendering settings.
# See Also
MaterialNode Class
Autodesk.Revit.DB Namespace